laragigs/app/Http/Controllers/ListingController.php

SELECT * FROM `listings` ORDER BY `created_at` DESC LIMIT 6 offset 0
SELECT count(*) as aggregate FROM `listings`
---
    public function index(){
        return view('listings.index',[
            'listings' => Listing::latest()->filter([request('tag'), request('search')])->paginate(5)
        ]);

SELECT * FROM `listings` WHERE `listings`.`id` = 'create' LIMIT 1
---
    public function show($id){
        return view('listings.show',[
            'listing' => Listing::find($id)
        ]);

INSERT INTO `listings` (`title`, `company`, `location`, `website`, `email`, `tags`, `description`, `updated_at`, `created_at`) VALUES ('Junior Laravel Developer', 'Wayne Enterprises', 'Leskovac', 'www.aleksic.rs', 'markomilenovic7@gmail.com', 'laravel,api, backend', 'AWDJQWKDQWL', '2023-07-11 09:46:15', '2023-07-11 09:46:15')
---
    public function store(Request $request){

        $formFields = $request->validate([
            'title' => 'required',
            'company' => ['required', Rule::unique('listings', 'company')],
            'location' => 'required',
            'website' => 'required',
            'email' => ['required', 'email'],
            'tags' => 'required',
            'description' => 'required'
        ]);


        Listing::create($formFields);